## DataFrame Demo

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 新增 Create

In [2]:
data = {
            'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
       }
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [3]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [4]:
obj = Series([4, 7, -5, 3, 10], index=['d', 'b', 'a', 'c', 'e'])
obj2 = Series([8, 1, 2, -21], index=['d', 'b', 'a', 'c'])
DataFrame({'col1': obj, 'col2': obj2})

   col1  col2
a    -5   2.0
b     7   1.0
c     3 -21.0
d     4   8.0
e    10   NaN

In [5]:
frame3 = DataFrame({'year': {'one': 2000, 'two': 2001, 'three': 2002, 'four': 2001, 'five': 2002}, 
                    'state': {'one': 'Ohio', 'two': 'Ohio', 'three': 'Ohio', 'four': 'Nevada', 'five': 'Nevada'},
                    'pop': {'one': 1.5, 'two': 1.7, 'three': 3.6, 'four': 2.4, 'five': 2.9}})
frame3

       year   state  pop
five   2002  Nevada  2.9
four   2001  Nevada  2.4
one    2000    Ohio  1.5
three  2002    Ohio  3.6
two    2001    Ohio  1.7

### 查找 Read

In [6]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

In [10]:
frame2.shape

(5, 4)

In [11]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [12]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [13]:
frame2['state']    # 获取一列，得到一个Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [14]:
frame2.state    # 获取一列，得到一个Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [15]:
frame2[['state', 'debt']]    # 获取多列，得到一个DataFrame

        state debt
one      Ohio  NaN
two      Ohio  NaN
three    Ohio  NaN
four   Nevada  NaN
five   Nevada  NaN

In [16]:
frame2['one':'one']    # 获取行，必须使用切片的方式 []

     year state  pop debt
one  2000  Ohio  1.5  NaN

In [17]:
frame2[0:4]    # 前4行，容易混淆   [)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN

In [18]:
frame2.reindex(['two', 'one'])    # 选出特定的行，按照参数的顺序

     year state  pop debt
two  2001  Ohio  1.7  NaN
one  2000  Ohio  1.5  NaN

In [19]:
frame2.loc['one':'three', ['state', 'debt']]    # loc使用index名字，第一个参数索引行，第二个参数索引列

      state debt
one    Ohio  NaN
two    Ohio  NaN
three  Ohio  NaN

In [20]:
frame2.loc[:, ['state', 'debt']]    # 所有行

        state debt
one      Ohio  NaN
two      Ohio  NaN
three    Ohio  NaN
four   Nevada  NaN
five   Nevada  NaN

In [21]:
frame2.loc['one':'one', ['state', 'debt']]    # 一行，得到DataFrame

    state debt
one  Ohio  NaN

In [22]:
frame2.loc['one', ['state', 'debt']]    # 一行，得到Series

state    Ohio
debt      NaN
Name: one, dtype: object

In [23]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [24]:
frame2.iloc[0:3, [1, 3]]    # iloc使用绝对位置（从0开始），第一个参数索引行，第二个参数索引列， 推荐使用iloc

      state debt
one    Ohio  NaN
two    Ohio  NaN
three  Ohio  NaN

In [25]:
frame2.iloc[:, [1,3]]    # 所有行

        state debt
one      Ohio  NaN
two      Ohio  NaN
three    Ohio  NaN
four   Nevada  NaN
five   Nevada  NaN

In [26]:
frame2.iloc[0:1, [1, 3]]    # 一行，得到DataFrame

    state debt
one  Ohio  NaN

In [27]:
frame2.iloc[0, [1, 3]]    # 一行，得到Series

state    Ohio
debt      NaN
Name: one, dtype: object

### 修改 Set

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [30]:
frame2['debt'] = np.arange(5)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [31]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [32]:
frame2.name = 'data frame'
frame2.columns.name = 'columns'
frame2.index.name = 'index'
frame2

columns  year   state  pop  debt
index
one      2000    Ohio  1.5   NaN
two      2001    Ohio  1.7  -1.2
three    2002    Ohio  3.6   NaN
four     2001  Nevada  2.4  -1.5
five     2002  Nevada  2.9  -1.7

In [33]:
frame2.columns = ['a', 'b', 'c', 'd']
frame2

          a       b    c    d
index
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7 -1.2
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4 -1.5
five   2002  Nevada  2.9 -1.7

In [34]:
frame2.index = [1, 2, 3, 4, 5]
frame2

      a       b    c    d
1  2000    Ohio  1.5  NaN
2  2001    Ohio  1.7 -1.2
3  2002    Ohio  3.6  NaN
4  2001  Nevada  2.4 -1.5
5  2002  Nevada  2.9 -1.7

### 删除 Delete

In [35]:
frame2.drop([1, 2], inplace=True, axis=0)    # 删除行，inplace参数控制是否真正删除
frame2

      a       b    c    d
3  2002    Ohio  3.6  NaN
4  2001  Nevada  2.4 -1.5
5  2002  Nevada  2.9 -1.7

In [36]:
frame2.drop(['a', 'b'], axis=1)    # 删除列

     c    d
3  3.6  NaN
4  2.4 -1.5
5  2.9 -1.7

In [37]:
frame2.pop('c')    # 真正删除
frame2

      a       b    d
3  2002    Ohio  NaN
4  2001  Nevada -1.5
5  2002  Nevada -1.7

In [38]:
del frame2['a']
frame2

        b    d
3    Ohio  NaN
4  Nevada -1.5
5  Nevada -1.7

### 运算

In [39]:
frame3['pop'] > 2

five      True
four      True
one      False
three     True
two      False
Name: pop, dtype: bool

In [40]:
frame3[frame3['pop'] > 2]

       year   state  pop
five   2002  Nevada  2.9
four   2001  Nevada  2.4
three  2002    Ohio  3.6

In [41]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [42]:
frame['pop'].apply(lambda x: x**3)    # 对df的某一列应用一个函数，生成新的Series

0     3.375
1     4.913
2    46.656
3    13.824
4    24.389
Name: pop, dtype: float64